app/controllers/api/v1/companies_controller.rb

      	def index
      		if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = Company.limit(limit).offset(from).to_a
---
SELECT  "companies".* FROM "companies"  LIMIT 2 OFFSET 0

      	def show
            begin
              user = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = ? LIMIT 1  [["id", 2]]

        def create
          	response, status = Company.create_from_model(:name => params[:name], :phone => params[:phone], :representative => params[:representative], :nit => params[:nit], :address => params[:address], :email => params[:email])
---
INSERT INTO "companies" ("address", "created_at", "email", "name", "nit", "phone", "representative", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

        def update
            response, status = Company.update_from_model(:id => params[:id], :token => params[:token], :name => params[:name], :phone => params[:phone], :representative => params[:representative], :nit => params[:nit], :address => params[:address], :email => params[:email])
---
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = 3  [["name", "Tuix CO"], ["updated_at", "2015-01-18 20:03:44.969718"]]

        def search
          if request.headers['Range']
            from, to = get_range_header()
            limit = to - from + 1
            query_response = Company.search(params[:search]).limit(limit).offset(from).to_a
---
SELECT  "companies".* FROM "companies"  WHERE (name LIKE '%Tuix CO%' OR phone LIKE '%Tuix CO%' OR representative LIKE '%Tuix CO%' OR nit LIKE '%Tuix CO%' OR address LIKE '%Tuix CO%' OR email LIKE '%Tuix CO%') LIMIT 11 OFFSET 0

        def get_vehicles
          if request.headers['Range']
            from, to = get_range_header()
            limit = to - from + 1
            query_response = Company.find(params[:id]).vehicles.limit(limit).offset(from).to_a
---
SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."company_id" = ? LIMIT 2 OFFSET 0  [["company_id", 1]]