app/controllers/api/v1/rides_controller.rb

      	def index
      		if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = Ride.limit(limit).offset(from).to_a
---
SELECT  "rides".* FROM "rides"  LIMIT 2 OFFSET 0

      	def show
            begin
              user = Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides"  WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]

        def create
          	response, status = Ride.create_from_model(:started_at => params[:started_at], :ended_at => params[:ended_at], :average_speed => params[:average_speed], :vehicle_id => params[:vehicle_id], :user_id => params[:user_id], :gps_id => params[:gps_id])
---
INSERT INTO "rides" ("average_speed", "created_at", "gps_id", "updated_at", "user_id", "vehicle_id") VALUES (?, ?, ?, ?, ?, ?)  [["average_speed", 0.0], ["created_at", "2015-01-19 18:20:11.476641"], ["gps_id", 3], ["updated_at", "2015-01-19 18:20:11.476641"], ["user_id", 2], ["vehicle_id", 3]]

        def destroy
            response, status = Ride.destroy_from_model(:id => params[:id])
---
DELETE FROM "rides" WHERE "rides"."id" = ?  [["id", 5]]

        def update
            response, status = Ride.update_from_model(:id => params[:id], :started_at => params[:started_at], :ended_at => params[:ended_at], :average_speed => params[:average_speed], :vehicle_id => params[:vehicle_id], :user_id => params[:user_id], :gps_id => params[:gps_id])
---
UPDATE "rides" SET "average_speed" = ?, "updated_at" = ? WHERE "rides"."id" = 1  [["average_speed", 69.3], ["updated_at", "2015-01-19 18:09:00.173417"]]