app/controllers/api/v1/roles_controller.rb

      	def index
      		if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = Role.limit(limit).offset(from).to_a
---
SELECT  "roles".* FROM "roles"  LIMIT 2 OFFSET 0

      	def show
            begin
              user = Role.find(params[:id])
---
SELECT  "roles".* FROM "roles"  WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]

        def create
          	response, status = Role.create_from_model(:name => params[:name])
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-02 22:06:08.448525"], ["name", "guest"], ["updated_at", "2015-01-02 22:06:08.448525"]]

        def destroy
            response, status = Role.destroy_from_model(:id => params[:id], :token => params[:token])
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 4]]

        def update
            response, status = Role.update_from_model(:id => params[:id], :token => params[:token], :name => params[:name])
---
UPDATE "roles" SET "name" = ?, "updated_at" = ? WHERE "roles"."id" = 3  [["name", "a"], ["updated_at", "2015-01-02 22:52:34.913493"]]

          def search
            if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = Role.search(params[:search]).limit(limit).offset(from).to_a
---
SELECT  "roles".* FROM "roles"  WHERE (name LIKE '%@gmail.com%') LIMIT 2 OFFSET 0