app/controllers/api/v1/users_controller.rb

SELECT  "users"."id", "users"."role_id", "users"."name", "users"."email", "users"."created_at", "users"."updated_at" FROM "users"  LIMIT 2 OFFSET 0
---
          def index
            if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = User.select(:id, :role_id, :name, :email, :created_at, :updated_at).limit(limit).offset(from).to_a

INSERT INTO "users" ("created_at", "email", "name", "role_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-02 14:30:15.591027"], ["email", "mile0057@gmail.com"], ["name", "Milena"], ["role_id", 2], ["updated_at", "2015-01-02 14:30:15.591027"]]
---
          def create
            response, status = User.create_from_model(:name => params[:name], :role_id => params[:role_id], :password => params[:password], :email => params[:email])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
          def destroy
            response, status = User.destroy_from_model(:id => params[:id], :token => params[:token], :controller => params[:controller], :action => params[:action])

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = 26  [["password", "4d186321c1a7f0f354b297e8914ab240"], ["updated_at", "2015-01-02 16:25:02.442112"]]
---
          def update
            response, status = User.update_from_model(:id => params[:id], :token => params[:token], :name => params[:name], :role_id => params[:role_id], :email => params[:email], :controller => params[:controller], :action => params[:action])

SELECT  "users".* FROM "users"  WHERE "users"."password" = '4d186321c1a7f0f354b297e8914ab240' AND "users"."email" = 'julio0060@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1
---
          def login
            user = User.where(password: Digest::MD5.hexdigest(params[:password]), email: params[:email]).first

SELECT  "users"."id", "users"."role_id", "users"."name", "users"."email", "users"."created_at", "users"."updated_at" FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
          def show
            begin
              user = User.select(:id, :role_id, :name, :email, :created_at, :updated_at).find(params[:id])

SELECT  "roles".* FROM "roles"  WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
          def role
            begin
              role = User.find(params[:id]).role

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password", "e10adc3949ba59abbe56e057f20f883e"], ["updated_at", "2015-01-03 22:14:44.494777"]]
---
          def update_password
            response, status = User.update_password(:id => params[:id], :current_password => params[:current_password], :new_password => params[:new_password], :token => params[:token], :controller => params[:controller], :action => params[:action])

SELECT  "users"."id", "users"."role_id", "users"."name", "users"."email", "users"."created_at", "users"."updated_at" FROM "users"  WHERE (name LIKE '%Sebas%' OR email LIKE '%Sebas%') LIMIT 2 OFFSET 0
---
          def search
            if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = User.select(:id, :role_id, :name, :email, :created_at, :updated_at).search(params[:search]).limit(limit).offset(from).to_a