app/controllers/api/v1/vehicles_controller.rb

SELECT  "vehicles".* FROM "vehicles"  LIMIT 2 OFFSET 0
---
      	def index
      		if request.headers['Range']
              from, to = get_range_header()
              limit = to - from + 1
              query_response = Vehicle.limit(limit).offset(from).to_a

SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."id" = ? LIMIT 1  [["id", 2]]
---
      	def show
            begin
              user = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("brand", "company_id", "created_at", "license_plate", "model", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["brand", "Ferrary"], ["company_id", 1], ["created_at", "2015-01-19 02:26:23.398695"], ["license_plate", "AAa231"], ["model", "1977"], ["updated_at", "2015-01-19 02:26:23.398695"]]
---
        def create
          	response, status = Vehicle.create_from_model(:brand => params[:brand], :model => params[:model], :license_plate => params[:license_plate], :company_id => params[:company_id])

UPDATE "vehicles" SET "model" = ?, "updated_at" = ? WHERE "vehicles"."id" = 5  [["model", "1990"], ["updated_at", "2015-01-19 02:39:05.061207"]]
---
        def update
            response, status = Vehicle.update_from_model(:id => params[:id], :token => params[:token], :brand => params[:brand], :model => params[:model], :license_plate => params[:license_plate], :company_id => params[:company_id])

SELECT  "vehicles".* FROM "vehicles"  WHERE (brand LIKE '%Aveo%' OR model LIKE '%Aveo%' OR license_plate LIKE '%Aveo%') LIMIT 11 OFFSET 0
---
        def search
          if request.headers['Range']
            from, to = get_range_header()
            limit = to - from + 1
            query_response = Vehicle.search(params[:search]).limit(limit).offset(from).to_a